enable

config

vlan 100 name "Серверы"
vlan 200 name "Клиенты"
vlan 300 name "Управление"

exit


# повторить это на обоих маршрутизаторах

interface vlan 100
  ip address 192.168.100.1 255.255.255.0
  no shutdown

interface vlan 200
  ip address 192.168.200.1 255.255.255.0
  no shutdown

interface vlan 300
  ip address 192.168.300.1 255.255.255.0
  no shutdown

ip route 0.0.0.0 0.0.0.0 192.168.100.1
ip route 192.168.200.0 0.0.0.0 192.168.200.1

# повторить это на обоих маршрутизаторах

# 4. Расчет подсетей
# 4.1. VLAN 100:

# Количество хостов: 30
# Сеть: 192.168.100.0/24
# Доступные IP-адреса: 192.168.100.1 - 192.168.100.30

# 4.2. VLAN 200:
# Количество хостов: 30
# Сеть: 192.168.200.0/24
# Доступные IP-адреса: 192.168.200.1 - 192.168.200.30
# 4.3. VLAN 300:

# Количество хостов: 30
# Сеть: 192.168.300.0/24
# Доступные IP-адреса: 192.168.300.1 - 192.168.300.30
